- DataFrame.drop_duplicates(subset=None, keep='first', inplace=False)

### Example #1: Removing rows with same First Name
- In the following example, rows having same First Name are removed and a new data frame is returned.

In [1]:
# importing pandas package 
import pandas as pd

In [2]:
# making data frame from csv file 
data = pd.read_csv("employees.csv") 
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [3]:
data.shape

(1000, 8)

In [4]:
# sorting by first name 
data.sort_values("First Name", inplace = True)
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution

- **As shown in the image, the rows with same names were removed from data frame.**

In [5]:
# dropping ALL duplicte values 
data.drop_duplicates(subset ="First Name", keep = False, inplace = True) 
  
# displaying data 
data.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
688,Brian,Male,4/7/2007,10:47 PM,93901,17.821,True,Legal
190,Carol,Female,3/19/1996,3:39 AM,57783,9.129,False,Finance
887,David,Male,12/5/2009,8:48 AM,92242,15.407,False,Legal
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

In [6]:
data.shape

(9, 8)

### Example #2: Removing rows with all duplicate values
- In this example, rows having all values will be removed. Since the csv file isnâ€™t having such a row, a random row is duplicated and inserted in data frame first.

- As shown in the output image, the length after removing duplicates is 999. Since the keep parameter was set to False, all of the duplicate rows were removed.

In [7]:
#length before adding row 
length1 = len(data) 
  
# manually inserting duplicate of a row of row 440 
data.loc[1001] = [data["First Name"][440], 
                  data["Gender"][440], 
                  data["Start Date"][440], 
                  data["Last Login Time"][440], 
                  data["Salary"][440], 
                  data["Bonus %"][440], 
                  data["Senior Management"][440], 
                  data["Team"][440]] 
                      
# length after adding row 
length2=  len(data) 
  
# sorting by first name 
data.sort_values("First Name", inplace=True) 
  
# dropping duplicate values 
data.drop_duplicates(keep=False,inplace=True) 
  
# length after removing duplicates 
length3=len(data) 
  
# printing all data frame lengths  
print(length1, length2, length3)

KeyError: 440